airbagi/STM32CardReader/app.c
/**
  ******************************************************************************
  * @file    app.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    19-March-2012
  * @brief   This file provides all the Application firmware functions.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; 2012 STMicroelectronics</center></h2>
  *
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"

#include "usbd_msc_core.h"
#include "usbd_usr.h"
#include "usbd_desc.h"
#include "usb_conf.h"

#include "systick.h"
void
initialise_monitor_handles (void);
/** @addtogroup STM32_USB_OTG_DEVICE_LIBRARY
  * @{
  */


/** @defgroup APP_MSC
  * @brief Mass storage application module
  * @{
  */

/** @defgroup APP_MSC_Private_TypesDefinitions
  * @{
  */


/** @defgroup APP_MSC_Private_Defines
  * @{
  */

/** @defgroup APP_MSC_Private_Macros
  * @{
  */


/** @defgroup APP_MSC_Private_Variables
  * @{
  */

#ifdef USB_OTG_HS_INTERNAL_DMA_ENABLED
  #if defined ( __ICCARM__ ) /*!< IAR Compiler */
    #pragma data_alignment=4
  #endif
#endif /* USB_OTG_HS_INTERNAL_DMA_ENABLED */

__ALIGN_BEGIN USB_OTG_CORE_HANDLE     USB_OTG_dev  __ALIGN_END ;


/** @defgroup APP_MSC_Private_FunctionPrototypes
  * @{
  */


/** @defgroup APP_MSC_Private_Functions
  * @{
  */


/**************************************************************************/
/**
  * @brief  Program entry point
  * @param  None
  * @retval None
  */
int main(void)
{
  __IO uint32_t i = 0;
#ifdef DEBUG
	initialise_monitor_handles();
#endif

  /*!< At this stage the microcontroller clock setting is already configured,
  this is done through SystemInit() function which is called from startup
  file (startup_stm32fxxx_xx.s) before to branch to application main.
  To reconfigure the default setting of SystemInit() function, refer to
  system_stm32fxxx.c file
  */
  sysTickSetup();
  USBD_Init(&USB_OTG_dev,
#ifdef USE_USB_OTG_HS
            USB_OTG_HS_CORE_ID,
#else
            USB_OTG_FS_CORE_ID,
#endif
            &USR_desc,
            &USBD_MSC_cb,
            &USR_cb);
	uint32_t dwTick = sysTickGet();
  while(1)
  {
  	if ((sysTickGet() - dwTick)>1000000)
  		{
      STM_EVAL_LEDToggle(LED4);
      dwTick = sysTickGet();
  		}
  }
}


#ifdef USE_FULL_ASSERT
/**
* @brief  assert_failed
*         Reports the name of the source file and the source line number
*         where the assert_param error has occurred.
* @param  File: pointer to the source file name
* @param  Line: assert_param error line source number
* @retval None
*/
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
  ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {}
}
#endif


/************************ STMicroelectronics *****END OF FILE****/
